{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.7.4r1", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 1], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "block1_conv1_bn", "class_name": "BatchNormalization", "config": {"name": "block1_conv1_bn", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "block1_conv1_act", "class_name": "Activation", "config": {"name": "block1_conv1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["block1_conv1_bn", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block1_conv1_act", 0, 0, {}]]]}, {"name": "block1_conv2_bn", "class_name": "BatchNormalization", "config": {"name": "block1_conv2_bn", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "block1_conv2_act", "class_name": "Activation", "config": {"name": "block1_conv2_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["block1_conv2_bn", 0, 0, {}]]]}, {"name": "separable_conv2d_1", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]]}, {"name": "block2_sepconv1_bn", "class_name": "BatchNormalization", "config": {"name": "block2_sepconv1_bn", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_1", 0, 0, {}]]]}, {"name": "block2_sepconv2_act", "class_name": "Activation", "config": {"name": "block2_sepconv2_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["block2_sepconv1_bn", 0, 0, {}]]]}, {"name": "separable_conv2d_2", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["block2_sepconv2_act", 0, 0, {}]]]}, {"name": "block2_sepconv2_bn", "class_name": "BatchNormalization", "config": {"name": "block2_sepconv2_bn", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["block2_sepconv2_bn", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]]}, {"name": "block3_sepconv1_act", "class_name": "Activation", "config": {"name": "block3_sepconv1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "separable_conv2d_3", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["block3_sepconv1_act", 0, 0, {}]]]}, {"name": "block3_sepconv1_bn", "class_name": "BatchNormalization", "config": {"name": "block3_sepconv1_bn", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_3", 0, 0, {}]]]}, {"name": "block3_sepconv2_act", "class_name": "Activation", "config": {"name": "block3_sepconv2_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["block3_sepconv1_bn", 0, 0, {}]]]}, {"name": "separable_conv2d_4", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_4", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["block3_sepconv2_act", 0, 0, {}]]]}, {"name": "block3_sepconv2_bn", "class_name": "BatchNormalization", "config": {"name": "block3_sepconv2_bn", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_4", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["block3_sepconv2_bn", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "global_average_pooling2d_1", "class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "predictions", "class_name": "Activation", "config": {"name": "predictions", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["predictions", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_1/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_2/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "block1_conv1_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "block1_conv1_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "block1_conv1_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block1_conv1_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block1_conv2_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "block1_conv2_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "block1_conv2_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "block1_conv2_bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "block2_sepconv1_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "block2_sepconv1_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "block2_sepconv1_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "block2_sepconv1_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "block2_sepconv2_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "block2_sepconv2_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "block2_sepconv2_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "block2_sepconv2_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "block3_sepconv1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "block3_sepconv1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "block3_sepconv1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "block3_sepconv1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "block3_sepconv2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "block3_sepconv2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "block3_sepconv2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "block3_sepconv2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 256, 7], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [7], "dtype": "float32"}, {"name": "separable_conv2d_1/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "separable_conv2d_1/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "separable_conv2d_2/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "separable_conv2d_2/pointwise_kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "separable_conv2d_3/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "separable_conv2d_3/pointwise_kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "separable_conv2d_4/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "separable_conv2d_4/pointwise_kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}]}]}